app/views/lists/_completed.html.erb

<% @list.tasks.completed.each do |task| %>
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."list_id" = 1 AND "tasks"."completed" = 't' ORDER BY position

	    	<div>
	    		<%= task.description %> | <%= task.user.full_name %> | <%= "done " + time_ago_in_words(task.updated_at) + " ago" %>
---
UPDATE "tasks" SET "completed" = 't', "updated_at" = '2013-02-23 21:23:08.954941' WHERE "tasks"."id" = 3