app/views/lists/_incompletes.html.erb

 <table class="table table-hover table-condensed">
  <% @list.tasks.incomplete.each do |task| %>
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."list_id" = 1 AND "tasks"."id" = ? LIMIT 1  [["id", "1"]]