app/views/lists/show.html.erb

  <ul class="task-list" id="incomplete">
    <% @list.tasks.incomplete.each do |task| %>
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."list_id" = 1