app/controllers/invitations_controller.rb

  def create
    @list = List.find(params[:invitation][:invited_for_id]) if params[:invitation][:invited_for_type] == "List"
    @invitation = Invitation.new(params[:invitation])
    @invitation.invited_by = current_user.id
    @invitation.save
---
SELECT "lists".* FROM "lists" WHERE "lists"."id" = 1 LIMIT 1
INSERT INTO "invitations" ("accepted_at", "created_at", "email", "invited_by", "invited_for_id", "invited_for_type", "token", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "users" ("confirmation_sent_at", "confirmation_token", "confirmed_at", "created_at", "current_sign_in_at", "current_sign_in_ip", "email", "encrypted_password", "first_name", "last_name", "last_sign_in_at", "last_sign_in_ip", "profile_name", "remember_created_at", "reset_password_sent_at", "reset_password_token", "sign_in_count", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)