app/controllers/lists_controller.rb

INSERT INTO "lists" ("complete", "completed_at", "created_at", "description", "name", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)
INSERT INTO "list_team_members" ("active", "created_at", "list_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["active", true], ["created_at", Sat, 23 Feb 2013 21:21:40 UTC +00:00], ["list_id", 1], ["updated_at", Sat, 23 Feb 2013 21:21:40 UTC +00:00], ["user_id", 1]]
---
  def create
    @list = current_user.lists.new(params[:list])
    if @list.save
      flash[:notice] = "List created"
      list_team_member = ListTeamMember.create(:user_id => current_user.id, :list_id => @list.id, :active => true)

UPDATE "lists" SET "complete" = 't', "completed_at" = '2013-02-23 21:23:57.064590', "updated_at" = '2013-02-23 21:23:57.066406' WHERE "lists"."id" = 1
---
  def mark_complete
    #Don't use update_attributes. security issue. allows mass assignment
    @list.complete = true
    @list.completed_at = Time.now
    @list.save

UPDATE "lists" SET "complete" = 'f', "completed_at" = NULL, "updated_at" = '2013-02-23 21:24:04.964125' WHERE "lists"."id" = 1
---
  def mark_uncomplete
    @list.complete = false
    @list.completed_at = nil
    @list.save

SELECT "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT 1  [["id", "1"]]
---
  def find_list
    @list = List.find(params[:id])