app/controllers/lists_controller.rb

SELECT "list_team_members".* FROM "list_team_members" WHERE (list_id = 1 AND active = 't')
---
  def show
    @list = List.find(params[:id])
    @list_team_members = ListTeamMember.where('list_id = ? AND active = ?', @list.id, true)