app/controllers/registrations_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = 'tony@54footy.com' LIMIT 1
SELECT "invitations".* FROM "invitations" WHERE "invitations"."email" = 'tony@54footy.com' AND (accepted_at is not NULL) LIMIT 1
SELECT 1 AS one FROM "users" WHERE "users"."email" = 'tony@54footy.com' LIMIT 1
UPDATE "users" SET "last_sign_in_at" = '2013-02-23 21:19:54.370032', "current_sign_in_at" = '2013-02-23 21:19:54.370032', "last_sign_in_ip" = '127.0.0.1', "current_sign_in_ip" = '127.0.0.1', "sign_in_count" = 1, "updated_at" = '2013-02-23 21:19:54.372520' WHERE "users"."id" = 1
INSERT INTO "users" ("confirmation_sent_at", "confirmation_token", "confirmed_at", "created_at", "current_sign_in_at", "current_sign_in_ip", "email", "encrypted_password", "first_name", "last_name", "last_sign_in_at", "last_sign_in_ip", "profile_name", "remember_created_at", "reset_password_sent_at", "reset_password_token", "sign_in_count", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    #If the user is already invited(created with empty password), update it. Users are allowed to sign-up directly, which will override the record created by invitation.
    user = User.find_by_email(params[:user][:email])
    invitation = Invitation.where(:email => params[:user][:email]).where("accepted_at <> ''").first

    if !user.blank? && !invitation.blank? && user.encrypted_password.blank?
      if user.update_attributes(params[:user])
        #User need to reconfirm in this case, as he signed-up directly, despite invitation.
        user.generate_new_confirmation_token()
        user.send_confirmation_instructions

        sign_in(user)
        redirect_to after_sign_up_path_for(user)
      else
        clean_up_passwords user
        self.resource = user
        respond_with user
      end
    else
      build_resource #from devise
      if resource.save