app/controllers/tasks_controller.rb

  def create
    @task = @list.tasks.new(params[:task])
    if @task.save
---
INSERT INTO "tasks" ("completed", "created_at", "description", "due_date", "list_id", "position", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def complete
    @task = @list.tasks.find(params[:id])

    @task.update_attributes({
      completed: true
    })
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."list_id" = 1 AND "tasks"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "tasks" SET "completed" = 't', "updated_at" = '2013-02-23 21:23:08.954941' WHERE "tasks"."id" = 3

  def incomplete
    @task = @list.tasks.find(params[:id])
    @task.update_attributes({
      completed: false
    })
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."list_id" = 1 AND "tasks"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "tasks" SET "completed" = 'f', "updated_at" = '2013-02-23 21:23:44.138217' WHERE "tasks"."id" = 1

  def sort
    params[:tasks].each_with_index do |id, index|
      @list.tasks.update_all(['position=?', index+1], ['id=?', id])
---
UPDATE "tasks" SET position=1 WHERE (id='3')

  def find_list
    @list = List.find(params[:list_id])
---
SELECT "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT 1  [["id", "1"]]